clientes/app/controllers/clientes_controller.rb

INSERT INTO "clientes" ("nombre_o_razon_social", "identificacion", "correo", "direccion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @cliente = Cliente.new(cliente_params)

    if @cliente.save

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cliente = Cliente.find(params[:id])