facturas/app/controllers/facturas_controller.rb

  def create
    @factura = Factura.new(factura_params)

    # --- Validar que el cliente exista en el microservicio de clientes ---
    begin
      # IMPORTANTE: dentro del contenedor Docker, el host es 'clientes' y el puerto interno 3000
      cliente_resp = Faraday.get("http://clientes:3000/clientes/#{@factura.cliente_id}")

    rescue Faraday::ConnectionFailed
      render json: { error: "Servicio de Clientes no disponible" }, status: :service_unavailable
      return
    end

    # --- Guardar factura ---
    if @factura.save
---
SELECT "facturas".* FROM "facturas"
INSERT INTO "facturas" ("cliente_id", "total", "fecha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["cliente_id", "1"], ["total", 200.5], ["fecha", "2025-11-02"], ["created_at", "2025-11-03 04:54:10.165608"], ["updated_at", "2025-11-03 04:54:10.165608"]]

  def show
    @factura = Factura.find(params[:id])
---
SELECT "facturas".* FROM "facturas" WHERE 1=1